{"name":"Faye's Purpose","writer":"RudRecciah","tags":["8"],"theory":"Death. One of the few things that most people could agree on is usually not that amazing. The reason that the characters in TTM's world keep on going back to Sigmund. The thing Neil sees happen almost daily. Not only does he see death, but he sees it from the eyes of the ones doing the dying. His experiences? Death. His thoughts? Death. His life? Death. He's encased in the thought of it, never able to escape its grasp. So, what would he do to cope? Naturally, he would want to find a way to keep himself alive as long as possible, or at least make sure he doesn't know he died. This is where his job comes in handy for him. Being a technician of a machine that helps to replace memories, he knows, to an extent, how the brain, and especially subconscious brain, operates.\n\nNow, if he knows how this machine and the brain work, then why doesn't he just replace all of his memories with happy ones and kill himself instantly, so he would just end up happy and without knowing he died? Because he knows the machine can do more than that. Each one of his clients are unconscious. This means that the machine has to copy and simulate the subconscious brain, as it's impossible for the brain to think of these memories while unconscious.* Neil knows this, but he also knows that he can't just connect someone to the machine and let that person live in a simulation; if the client had to leave they would die, on top of the client's subconsciousness being the only thing simulated, so they (as in that client's consciousness) wouldn't experience anything.**\n\nThis is where Faye comes in. Colin is the first person that Neil has worked on without the machine's stabilizers. This means that Faye, who would usually be represented as a book, is shown as a person.*** The reason this is so important? Faye represents Colin's subconsciousness.**** She's the first representation of what they're simulating he's ever seen, and on top of that she proves that she's aware. This means that Neil has a \"solution\" for death. Faye can be simulated on Sigmund's machines, meaning that she can live without a body. Anyone like her can be simulated in Sigmund's machine without a body. Without a body, there's no physical need for someone to leave the machine, which means that the machine can simulate people almost eternally. The machine can cure death. Although we know nothing about how consciousness works currently, some people suspect that its just being self-aware. If this turns out to be true, then subconsciousness checks all the boxes needed for something to be conscious, as proven by Faye being self-aware. (On another note, the subconscious brain is much smarter than the conscious brain, meaning that people in this machine would be close to, if not more powerful than a super-intelligent AI, which I honestly think is a pretty dope side effect). Neil needs Faye to learn exactly how the subconscious brain works. He needs to see how it operates to be able to convert consciousness into subconsciousness.***** Once he does that, he would probably distribute his modified machine, and make his own company, leaving Sigmund behind.\n\n\n\n\n\n\n\nFootnotes:\n\n* Q:But couldn't the machine just copy the memories of the patient and play them back instead of simulating subconsciousness? A:No, the machine can't do that as its impossible. First of all, the machine needs a way to playback the memories, which, if the machine had that function, would mean it was aware, as the machine would have the ability to think on subconscious proportions, which would render Faye importance to Neil useless. Second of all, the doctors have the ability to interact with the patient and change his memories before they finish the procedure, which means the memories aren't just simply a replay. Again, the clients are unconscious, so the machine can't interact with the patient directly, so the machine has to have a way to simulate subconsciousness to be able to function.\n\n** Q:But if the client connected to the machine and experienced nothing, why would the machine kill them? They only die because of conflicting memories. A:Well, they die because of conflicting memories. Their conscious brain and subconscious brain have different memories. One entered the machine, and the other didn't. (*) (**)\n\n*** Faye being represented as a book might be false, as Rob and Roxie had a patient like Colin. I'd assume that they wouldn't have removed the stabilizers, but they knew that this patient had someone like Faye, (***) so the stabilizers might have nothing to do with Faye at all.\n\n**** Faye claims to not represent all of Colin's subconsciousness, but I think the copy that Neil has represents all of his subconsciousness. Faye, as the one Colin interacts with, only represents a few parts of Colin's brain, as specific parts don't communicate with each other often or at all. The Faye Colin knows is only a piece of his subconsciousness, while the Faye Neil copied might be all of it. (****)\n\n***** Q:But if he knows how the brain works, why would he need Faye? A:He doesn't know everything, only enough to do his job.\n\nFootnotes of footnotes:\n\n(*) Q:But what if they relive their entire life inside the machine? Wouldn't everything work out fine? A:No, because the machine copies the ENTIRE subconscious brain, which includes all of the patient's memories. When the procedure is over, the patient would normally die as their brain wouldn't be able to function with the memory change. The patient doesn't die because some memories are replaced and they don't make sense, they die because all of the memories they previously had were overwritten with new memories. The brain in theory should work properly if the machine did nothing, but once something is changed the brain can't cope with it. The patient dies because the memories are different, not because specific memories are replaced with other ones.\n\n(**) Q:If you're splitting up the conscious and subconscious, why not continue with the unconscious? A:I'm not talking about unconsciousness in this because I'm referring to the subconscious by its psychological definition, \"The part of the mind that is not currently in focal awareness,\" which includes both the subconscious and unconscious.\n\n(***) Yes, I'm making the connection between Faye and subconsciousness, which would mean that everyone technically has someone like Faye. Although this is technically true, it isn't shown in every patient because having someone/thing represent the subconsciousness is relatively rare. On top of that, having someone/thing that represents the subconscious that lines up with someone/thing that is consciously thought about is even rarer. If Faye was just a conscious thought or imaginary friend, she wouldn't be able to interact with the doctors. If she was just his subconsciousness, she wouldn't have had any way for the doctors to see her.\n\n(****) Yeah, it sounds like there isn't much proof of Neil copying Faye as Colin's subconsciousness, but the machine simulates the subconscious brain, not the conscious one Colin knows, if it did the machine wouldn't be able to bring back some memories because they were consciously forgotten. So, by that logic, the only Faye Neil could've copied was the subconscious Faye. Something kind of confusing with this theory is that subconscious Faye would be the only one the doctors could interact with, so she has to somehow switch between the version in his memories and the version living in the machine, but that's probably the only thing I don't have to try to go into detail on. Again, there isn't much we know about how the brain works, and I'm not a neurologist, so for all I know there could be some way that Faye can enter Colin's memories or at least watch his memories from her (conscious thought version) viewpoint. Anyway that's a completely different theory on its own so I'll stop here."}