{"name":"Anti Tribute to Faye","writer":"Melium","tags":["8"],"theory":"This is an anti tribute to Faye, to fight against all this anti hate about her, all those people calling her Not \"Fake\" or Not \"Not real\". Let’s start with a very important point I’m going to prove with this essay (because it is more of an essay than a theory): Faye is not the greatest. She’s a pretty good character, and deserves love.\n\nNow, it is time for me to argue to those arguments explaining why \"Faye not not good\". I will for that refer to \"Tribute to Faye\" which refers to the incredibly well constructed Sofia VS Faye meme from Lou the cute, best boi, also called Violence in his free time.\n\n- \"- 'furry bird girl': what is wrong with being a bird? Birds are nice, the mind blown of the realization Faye was the bird is incredible, and principally... Why play Freebird games if you don’t like birds? It would actually be more of a compliment to Faye!\"\nThere is nothing wrong with being a bird, birds are indeed nice. I don't know if the realized Faye had her mind blown but I don't see anyone saying birds are bad. No one is saying birds are bad, but that Faye is a furry bird girl. The part that is not meant to be good is the furry part, not the bird part. Furries are cool, though some people are against that and I can kind of understand why.\n\n- \"- 'cheats against Neil in fights, still loses': technically Neil cheats too because he is the main administrator. Also, she had good reasons to cheat, but unfortunately she ended up losing because she wasn’t an administrator anymore... All of this for the story to end with Neil asking her to settle it the same way she would have if they left earlier.\"\nThat's not the point. There is no such thing as \"cheating\", as that word has no meaning here. The meme refers to how Faye uses underhanded methods to fight, yet still loses. It doesn't matter what Neil did, she still lost after making the first move. Also, Faye was never an administrator. We don't know what she would have done, so I can't say anything about the last part.\n\n- \"being that one mysterious character absolutely no ones know anything about.\" \nLiterally every new character in every game, for example Johnny, Colin, Quincy, Scarlet, etc.\n\n- \"You cannot say she isn’t real when she existed so vividly in his memories.\"\nThe doctors can put anything they want into anyone's memories. They can give people unicorns, fairies, giant space tentacles, and it will be real to the patient. Anyone could go into the patient's memories and see that same (obviously fake) thing. \"If a tree falls in a forest and no one is around to hear it, does it make a sound?\" If I thought I saw a monster in a store that made me leave but then I forgot about it, was it real? If I imagined the smell of a crab in the middle of a desert, then was the crab real? I agree Faye was important and impacted Colin a lot, but she is not \"real\" in the same sense that you and I are. She has no physical manifestation.\n\n- \"How would she have been able to gain consciousness of her own and actually act in the machine, and talk without Colin writing it? Because she had conversations with Neil and Eva. And Colin wasn’t writing it!\" \nI don't understand.\n\n- \"Our memories and everything in them is nothing but the fiction we tell ourselves\"\nAre Johnny's new memories, where he went to the moon, real? Is Angus's life, where he became a rock star, real? Is the crab I smelled real? I think we have some conflicting definitions of the word \"real\". The one thing that is certain is that sofaye is not.\n\nI hope I could not convert not all of you into the not \"Faye not good\" team, as there is not only one truth and the truth is not that Faye is a great character and that you all gotta love her.\n\nAnti Tribute to Faye — Fin"}