{"name":"How everything links together with a villain.","writer":"Dunan","tags":["4","5","6","7","8","9"],"theory":"Tl;dr: Everything takes place in Neil's head and Eva is traversing in it to save him.\n\nTo start of with what was Neil's purpose with the machine?\n\nHe had a falling out with his parents/dad (shown in SM 2) because his mom died (IF) partly because of the hereditary disease, which he has. Feeling constraint, he decided to finish his Mom's work and after years of hardship, he finally succeeded in IF.  For the falling out part, it's not so much as he blamed his parent/dad for it but he felt his limited time was best used to fixing the technology, hence he explained 'No. it's not them' (in SM2); his dad probably pestered him to make good use of his time instead. Because of his upbringing with his Mom, he was very much against Eva from deleting River, showing he understand the importance of other people's memory.\n\nIt was at this point he understood what his father has been telling him about. Since he has succeeded in his Mom's work, he was happy and was about to move on with his mortality. But...\n\nThe next few steps would be more of a prediction on how the story goes and how it ties all the freaky things in the series:\n\nIn IF we learnt that Dr. Louie was the first person to die from the machine, Lyndi's memory could be stored in the code, and (in FP; Faye) memories can be sentient. So my prediction is Dr. Louie's memory that was trapped in the code became sentient and wants out; Dr. Louie gained sentient finally in IF when Neil finally accessed Lyndi's memories. In order to do that he would need to take over Neil. So how would he do that? most likely manipulate certain memories of Neil's past to place self doubt, or even place his own childhood into Neil's so he could grow up to become a Dr. Louie.\n\nThe story would start off with Neil acting strange and such, until his friends caught wind of it (probably warned by Faye), and had to strap Neil in forcibly. At that point they didn't know exactly what they were dealing with but Faye, who was booted out of admin and couldn't do anything, only know something strange was going on inside his head, like 2 conflicting memories. Eva took on the task and strapped in leisurely at home, since the machine can be used remotely and they didn't know what exactly is happening so she thought it was no biggie.\n\nIn FP, Neil actually did sabotage his encounter with Collin but Faye intervened (she was the one on the motorbike). Both Eva and Faye were working together trying to prevent him from sabotaging. 2nd Faye presence was stronger since that particular time has her as a base. It was there Eva learnt the sabotage was particular important because Neil was successful in transplanting Faye into the machine.\n\nAs they traveled further they found some memories were conflicting and were Dr. Louie's (something like the Highschool memory  looked different than how Eva and Neil were in, but she could see it was Neil there, hence suspicions). Realizing Neil was trying to sabotage his own work to prevent Dr. Louie from taking over she realized it would be suicide. (it has been shown in IF the reset points are caused by activation of the machine for the first time, hence the many simulation occurring on repeats).  Instead, if she could convince Neil's own memory was more valuable than he realized, he could win. You know, before the many simulation collapses and kills him.\n\nWhen they were in Neil's memory (SM2), Faye was not strong to be of a presence hence why she's not around, or she has grown weaker. Alone, Eva  would find Neil trying to sabotage his own version of 'fixing the machine', hence we have a log of him turning off the power in SM2. Eva succeed in convincing him otherwise and let the Sigmund crew to help by lecturing him about it.\n\nMemory Dr. Louie, who has taken the admin role caught wind of the situation and needed to intervene. That would explain the power surge in SM2 (when Eva leaves) as he extended extra power to do so.\n\nEva would repeat this process  in TTM, explaining some out of place stuff, like the screen flashed red at the end, showing he was in a simulation. Then, realizing the severity of Dr. Louie, Eva needs to return to Sigmund Corp to be near Neil  for more power.\n\nThe deciding factor that made Neil wake up was his realization of Eva who was precious in his memories, and took full control back. Cue to a final battle with Eva in a Jellyfish robot, waifu Faye, platypus, and the gang battling Dr. Louie and everything ends well. In the real world Roxie and others would try to fight back in their own way.\n\nAnything goes for what Dr. Louie would plan to save himself but that's too much to think. There are a lot more I could write, like how Dr. Louie in Neil body made Roxy cry prompting his suspicions towards his friends, to all the revenge he sought when he died, or even wanting Neil to go back to the Dr. Yu and Haynes mansion to access some technology but that's all I could think of right now.\n\n\nIn the end when all said and done, real Neil would make a speech about being a simulation and we would see Kan writing out the story, showing Neil and Eva were indeed in a game simulation. Also, it does help Neil=Neo, and Dr.Louie=Agent smith who wants out.\n \n\n"}