{"name":"The Musical Triad - An Interpretation of Finding Paradise's trailer","writer":"DevAnj","tags":["8"],"theory":"I was a bit confused and disappointed that Finding Paradise's trailer didn't seem to have any clear and noticeable themes, unlike To the Moon's and Impostor Factory's trailers. Outside of the intro with the scale being played throughout Colin's life, and a brief part where the doctors enter a fantasy world in his memories, it was mostly just flashes of his life. I thought at first that this was an implication for Finding Paradise being another memory manipulation adventure \"just like\" To the Moon, given that it was riding off of its success.\n\nHowever, after a discussion yesterday, I decided to take a closer look. The intro showed Colin playing the cello, so I decided to take that it meant that he was represented by it. By that logic, it would follow that his wife is represented by the celesta. Keeping that in mind, I tried to analyze the music track for the trailer. It starts out with his wife as a sole, subdued voice, then is followed with Colin and a guitar in chorus with each other. This gives way to a portion where the wife and the guitar \"bounce\" off each other, as if they are competing, while Colin fades out momentarily. The guitar gets relegated to the background, and when Colin rejoins, the guitar gets dropped completely, replaced by some sort of bass/drum accompaniment. The song goes for a while in full momentum, then Colin abruptly falls off, leaving his wife as a sole voice again. She stays around for a while as a subdued, mellow voice, before fading away.\n\nMy reading of this is that it's essentially a story of three people represented through music. The doctors get introduced to Colin's life through his wife, he once mingled with a third person(likely Faye), then his wife and the third person briefly clashed before they faded out, making way for Colin and his wife to live together. They did so until Colin died of his old age, with his wife briefly surviving him before fading out herself. The only mystery here, if I am correct, is why this was left so subtle in the trailer. Likely, the answer is that people were expecting more To the Moon and so would be satisfied by something that outwardly looked like it.\n\nNote that I haven't played the game yet, so I am willing to revise this theory if I turn out to be wrong."}