{"name":"An In-Depth Look on Impostor Factory's Title Screen, and What It Might Mean","writer":"RudRecciah","tags":["4","7","8","9"],"theory":"The title screen of Impostor Factory is not like TTM and FP. Unlike those two which have buttons on the bottom, IF's title screen has buttons on the side much like ABS. This could imply that IF is structured similar to ABS, with a focus on something other than memory traversing. While the doctors memories will have something to do with the plot, the title screen implies memory traversal will only be a part of the plot, rather than the foundation of the plot. \n\nWe know the title screens include important things, like Anya for TTM and Colin's childhood apartment for FP. On IF's title screen we see a road, so what could this mean? One answer could be that the road is symbolic, as the IF trailer also includes a travel aspect, as seen in the red dress girl's walk through her lifetime. If we assume the road is symbolic of travel, we can make some predictions about what the road actually symbolizes. Since the entire series has revolved around life, we can assume the travel might have something to do with someone's life. Obviously, the biggest contender for the life we're traveling is Neil because of his character progression thus far. If it's Neil's life we're traveling, it might look a bit like this: **As a child, Neil is happy. As an adult, Neil is content but could be better. As a 40 year old man, Neil's going through an midlife crisis. But he manages to live through it as he has the foresight to know the road shouldn't end here from the countless lives he's seen during his job.** If we want to take this a bit further, we can also bring red dress girl into the mix, considering she seems to same stages as Neil in the trailer: **happy child, comfortable adult reading a suspiciously familiar green book, midlife crisis woman who somehow is on the moon without a helmet watching** ***an*** **earth being eaten by tentacles**. She also has the same travel aspect as I talked about earlier, with the trailer seeming to replace the normal graphic used to determine the life of a patient with her walking towards an abandoned mansion."}