{"name":"The Mirror Lied disease theory","writer":"WarriorFuzzlet","tags":["1"],"theory":"Disclaimer: The author of this theory is WarriorFuzzlet on steam, and I am just copying his steam review below, as this is a very good theory\nhttps://steamcommunity.com/profiles/76561198237496256/recommended/828050/\n\n\nFrom the maker of To The Moon and Finding Paradise, The Mirror Lied is a very short game which predates Freebird's two hit RGPs. Free to play, short and sweet, easy to navigate and progress through. It's a little cerebral though and the end will most likely leave you wondering what just happened. There are no jump scares, but the game successfully creates an unsettling atmosphere leading you to think there is going to be one just round the corner. If you like a good mystery then this is for you. If you don't like ambiguous endings, this is not for you.\n\nThere's a lot of subtle clues in the game that are easily overlooked as you progress so it can be worth a second playthrough: ||the images in the paintings disappear, water changes from blue to brown, the continents on the maps disappear.||\n\nThere are just as many unanswered questions which may or may not have any significance:\n||-Why does the globe have a strange odor, is it symbolic of a rotten, dying planet?\n-Why do the books have titles on the spines but the pages are all blank, does it suggest amnesia?\n-What do the timestamps mean on the note in the basement?\n-What's the meaning of the equations on the blackboard and the papers \"filled with foreign words\"?\n-Why are we shown a flashback to Leah's bedroom at the end of the game and the disappearance of her toys?\n-What's the meaning of the numbers hidden in the painting: 61|5491? Are they a mirror of 1945|16? The infamous Trinity Test took place on 16th July 1945, is this a reference to it?\n-Why does the giant teddy bear in her room freakishly jump around?||\n\nWhile I've come away from three playthroughs not having a fool- proof explanation for what's going on (indeed, I'm not sure you're ever meant to - see the creator's own thoughts on the subject here https://www.youtube.com/watch?v=0hnbwI3G3DI), there are a few things I feel reasonably certain about.\n||We are dealing with some sort of disease/biological agent which I think has contaminated the water:\n-The opening dialogue at the start of the game: \"A bird landed on water today. It flew away. Com'ere birdie. Oh, too late.\" This to me suggests that a water supply has been contaminated with a viral agent, they've tried to contain it, but have failed. It's too late, it's spread.\n-The water in the house turns from blue to brown part way through the game\n-There are additional references to the disease spreading \"Birdy grew wings today\" - it's become airborne perhaps, \"Birdie flew away. Catch it on its way over Africa\", \"It just flew over Europe\".\n-The disappearing continents on the world map are probably symbolic of the disease's spread across the planet\n-When you analyze the sample under the microscope the first slide is a rather well known image of H5N1. Not sure what the others are, maybe other diseases or more likely they are variant strains of bird flu, suggesting its mutation?\nThe fire is symbolic of a fever. Leah contracts the disease and becomes ill. She's advised to \"Sleep it off, it's not too late\". After resting the fire is mysteriously gone, so it's the only plausible explanation though I cannot explain why her bed falls through the ceiling!||\n\nSo many theories and so many unanswered questions:\n||-What's the symbolism with the bird in the end sequence?\n-And of the plant? Was there a significance to the bugs and pesticide?\n-Who is making the phone calls? Who is sending the emails?\n-Who was Leah? She appears to us as a child but her communications with the outside world don't give that impression. Was she a researcher trying to find a cure for the disease named 'birdie'? Some of the emails seem to suggest something like that: \"You must kill birdie before it flies over Europe, Leah.\", \"It just flew over Europe. What are you doing, Leah?\", \"We had a deal, Leah. Respond.\". Did she ultimately succumb to the disease herself? She had a fever and while it appeared that she recovered after some bedrest, are we certain that's what happened? Were the sequences after the fire real or in her mind? Had the disease totally taken over at that point preventing her from continuing her research and finding a cure, a way to \"kill birdie\"? Was her apparent suicide her actual death from the disease during the final stages when \"Birdie is about to fly over you\". The bird flew on, the virus continues to spread with the cure having not been found?\n-Is the whole thing just in someone's mind? The opening sequence of the game where you see a room flickering into existence and gradually populates with furniture, along with the flashback to the bedroom with its disappearing toys at the end make me feel like it could be. That and all the other weird clues that don't quite make sense. Given the subject of To The Moon and Finding Paradise, was The Mirror Lied a precursor to the idea of stepping into someone's mind to view their fractured memories?||\n\nThe ending messages are also quite cryptic.\n||I got: \"The others should be safe now\" and \"Well ... I suppose that worked\". I've heard there are others though they seem to be randomly generated rather than related to actions taken in game||\n\nAll of this from a ~30 minute game!\n\nThe art of The Mirror Lied is deceptively simple. Like the games that followed it, don't dismiss it for its style, the detail in the game is fabulous - just look at the design of the rug in the bedroom (my Mama had one just like it when I was a little 'un).\n\nThere were a couple of little UX annoyances for me. Before gaining the access card for the computer, whenever you interacted with the PC you'd get the Access Denied message twice before being able to move on.\nIt's also a shame that 'lists' have to be displayed over two pages. For example when examining the 5 drawers in a cabinet or the 7 emails on the computer, the first 3 are displayed on the first page along with a 'more' option to access the second page and remaining options. This isn't the end of the world, but after accessing each option, the dialog closes and the user has to interact with the item again. It's just a little clunky and leads to a lot of excess clicking. If memory serves I think I remember something similar in To The Moon or Finding Paradise, so it's perhaps a limitation of the system. Either way, all these issues are very minor grievances.\n\nOverall I really enjoyed it. It took maybe half an hour to get through but it left me thinking and theorizing about the meaning for hours afterwards which for me has been part of the fun (though I wouldn't spend too much time trying to work out a definite answer, you'll go round in circles)."}