{"name":"No Heaven After Sigmund","writer":"Merlandese","tags":["4","5","6","7","8"],"theory":"There is no heaven after Sigmund. Or at least... that's what people who use the Sigmund technology must believe.\n\nLet's look at the facts. Sigmund changes your memories. Done.\n\nSo what happens after you die? Does your soul retain the new memories? Or the old ones? Or both?\n\nOLD MEMORIES IDEA: If you retain your old memories in any way after you die, then there's no point of asking for Sigmund's help. The minute after you die, your \"soul\" will revert back to understanding its original lifeline, regrets and all, and you'll still have to deal with it.\n\nNEW MEMORIES IDEA: If you only retain the new memories after you die, this creates a strange problem. This implies that physical memories are all that matter. People with Alzheimer's and other types of memory problems would go into the afterlife just a mentally distorted as when they were alive, making the afterlife a weird, horrifying darkness of unknowable misremembering. And what about babies? Oof.\n\nWe can assume that the people in the world of Sigmund tech don't believe that the afterlife is a place where people with brain damage must remain with persistent brain damage (NEW MEMORIES IDEA). If they believed that, it wouldn't be much of a heaven, right? Not a very fair or meaningful afterlife. That means *if* they believe in an afterlife, they likely believe that you retain *all* your memories (old and Sigmund-made)—your full life—and even stuff that you forgot becomes unlocked to you (this is kind of the normal perception of Heaven).\n\nBut if they believed that your whole life of memories became apparent after death, then a last minute memory change would be meaningless. The whole Sigmund procedure would lose its value. You would have your memory changed, die, and then \"wake up\" in the afterlife knowing that you had the procedure and knowing that your life was still a regrettable one.\n\nThe conclusion is that people who sign up for Sigmund technology are atheists, pure and simple. If they believed in the OLD MEMORIES IDEA, they simply wouldn't waste time on the Sigmund process. Instead, they have their memories changed because the end of their life is the only life left to them, and they expect fully to disappear into nothingness afterward."}