{"name":"FP switch trailer theory","writer":"Melumi","tags":["8","9"],"theory":"​Eva says don't be dumb to Neil at the beginning, but doesn't tell him why they're going to the moon again, which makes sense as they don't end up on the moon.\nNeil falls, onto the clouds, which feels like concrete when he expected to be on the moon, which means he forgot what happened after the launch or lost consciousness.\nHe runs (run button is in IF?) and finds a chair reserved for \"sequel main character\", but doesn't say for which sequel. \nRoxie sends a squirrel at him, saying he's not worthy but Neil says he doesn't care, this could be a reference to when Eva told him not to be dumb, and now he's trying to take the main character's chair. \nRoxie shields herself from Neil's shoe and throws a Neil cat at Neil :theory: but Neil had full health which means this isn't in Ttm so this trailer isn't actually for fp. Also, Roxie drives Neil away from the main character chair, implying Neil isn't the main character of this game. However, Neil was one of the main characters in fp, but not IF, as \"this isn't their story.\" \"Instead, it's about *Quincy*.\" which makes sense as there is only one chair and it would be for Quincy as he is the main character as is said in the impostor factory steam page. Also, there is rumored to be a run button in IF, which could explain Neil's running to the chair. It is possible this is a hidden trailer for IF or contains spoilers that are well hidden. Perhaps Neil and Eva don't make it to the moon because Scarlet and Quincy are there for example.\nDuring Neil vs. Roxie, 1:23 \"A problem has been detected and the game has been shut down\" and under technical information, the access is Eva, which means she has something to do with this. A dialogue pops up (would you like to start over?) and the only option is yes, which is chosen. Since the access is Eva, this implies she is playing a game on a computer. We already know Neil is building his own machine, and there have been many theories already that he is trying to recreate reality (or a part of it) inside the machine, and Eva could be interacting with it inside the machine in this trailer, like during minisode 2. This also makes sense because there were two Evas in minisode two, and here there could also be one in the machine (going to the moon with Neil, perhaps a fantasy of his) and one outside the machine, who doesn't go in this time.\nAfter choosing to start over, it restarts at colin's visit to Sigmund corp, where he remarks that he had a strange daydream of people he doesn't even know, accompanied by glitches where the person he is talking to becomes static, like in the machine. This proves that Colin is in the machine, and as the \"game\" was just restarted, everyone is inside this machine. The only person Colin has had daydreams about before is Faye, who has been linked to the machine in the past and will likely be used by Neil in the future. Faye is likely part of the framework of this machine and because of this impacted colin's head, as she is also inside him, so he saw visions of things the machine Faye saw. At the end of the trailer, Faye walks out from behind a tree, with everything looking real, though if this truly is a trailer for IF, it wouldn't make sense for Colin to still be alive. However, Johhny and River weren't anywhere, even though the space rocket was at the beginning, most likely because Colin is linked to Faye and she might've wanted to see him again, even if it was just in the machine. More proof that this is in the machine lies in the Neil vs. Roxie fight, as they cannot teleport/do attacks irl, which supports the theory that this is all inside Neil's machine and that Eva is in real life, watching what Neil has created. The entire fight scene could be a glitch, as Neil is supposed to be on concrete (that's what he feels) though sees clouds, and the machine crashes. \nPerhaps this is all just a glimpse of the crazy things we will find in Impostor Factory. "}