{"name":"Tribute to Faye","writer":"Mambry","tags":["8"],"theory":"This is a tribute to Faye, to fight against all this hate about her, all those people calling her \"Fake\" or \"Not real\". Let’s start with a very important point I’m going to prove with this essay (because it is more of an essay than a theory): Faye is great. She’s a good character, and deserves tons of love.\n\nNow, it is time for me to argue to those arguments explaining why \"Faye bad\". I will for that refer to the incredibly well constructed Sofia VS Faye meme from Lou, also called Violence in his free time. \n\n- \"furry bird girl\": what is wrong with being a bird? Birds are nice, the mind blown of the realization Faye was the bird is incredible, and principally... Why play Free**bird** games if you don’t like birds? It would actually be more of a compliment to Faye!\n\n- \"disappears the second Colin finds a real woman\": first of all, Faye is real, but we’ll come back to this *later*. How is her disappearing when Colin needs her to a bad thing? She has been here to help him all his childhood, and watches him slowly fly on his own when he grows up... A bit like parents. Would parents be considered bad for that? No. So Faye isn’t to blame either.\n\n- \"cheats against Neil in fights, still loses\": technically Neil cheats too because he is the main administrator. Also, she had good reasons to cheat, but unfortunately she ended up losing because she wasn’t an administrator anymore... All of this for the story to end with Neil asking her to settle it the same way she would have if they left earlier. \n\n- \"blatantly obvious when trying to hide her sentience\": you can only say that to her when she decides to show herself and her secret is already out. Before that, she is pretty good at hiding it.\n\n- \"tried to kill Neil\": no, she only tried to scare him out of the machine to fulfill Colin’s true wish... Which Neil eventually understood.\n\n- \"not cool enough to be in pre Nintendo trailers\": cool enough to not be in any trailer (well except the switch one) and being that one mysterious character absolutely no ones know anything about.\n\n- \"Not even real\": she is real. In Colin’s head, maybe, but she still is. She helped him overcome lots of struggles that he couldn’t have without her. One of the main proves of it is that in his memories, she actually appears rather than Colin writing on a notebook. You cannot say she isn’t real when she existed so vividly in his memories. Furthermore, if she wasn’t real, how would she have been able to gain consciousness of her own and actually act in the machine, and talk *without Colin writing it*? Because she had conversations with Neil and Eva. And Colin wasn’t writing it! To quote some very smart person, \"Our memories  and everything in them is nothing but the fiction we tell ourselves\". Faye was definitely a very important figure in Colin’s life and she actually mattered. How can you tell someone who helped him in lots of ways isn’t real? Fiction isn’t necessarily fake. If it has an impact of some sort on anything, then... It definitely isn’t. I’d like to quote some other game (***Danganronpa V3 Severe Spoiler Warning***) \"Was this lie able to change something? Was this lie able to change someone? Was this lie... able to change the world? If it was able to change even the smallest thing, then... The story isn’t over.\" The message of the game is conveyed in this quote: \"even if it’s fictional, even if it doesn’t exist, if it has even the most tiny little impact on anything, then... It isn’t fake.\"(***SPOILER ALERT - END***)\n\nI hope I could convert all of you into the \"Faye good\" team, as there is only one truth and the truth is that Faye is a great character and that you all gotta love her.\n\nTribute to Faye — Fin\n\n"}